#include<stdio.h>

int main() {
    float a = 0.617;
    int b = 25;
    float c = 19;
    int d = 9;
    float e = 124.555;
    float f = 0.001;

    printf("a=%6.3f%%\n", a);   // %6.3f แสดงทศนิยม 3 ตำแหน่ง และมีความกว้าง 6 ตำแหน่ง
    printf("b=%4d%%\n", b);     // %4d แสดงจำนวนเต็ม 4 ตำแหน่ง  
    printf("c =%5.3f%%\n", c);  // %5.3f แสดงทศนิยม 3 ตำแหน่ง และมีความกว้าง 5 ตำแหน่ง
    printf("d  =%-2d%%\n", d);  // %-2d แสดงจำนวนเต็ม 2 ตำแหน่ง โดยจัดชิดซ้าย
    printf("e=%6.3f%%\n", e);   // %6.3f แสดงทศนิยม 3 ตำแหน่ง และมีความกว้าง 6 ตำแหน่ง
    printf("f=%5.3f%%\n", f);   // %5.3f แสดงทศนิยม 3 ตำแหน่ง และมีความกว้าง 5 ตำแหน่ง
    
    
    return 0;                   // จบการทำงานของโปรแกรม
}